Revit 2024 API
AnalyticalModelSelector Constructor
 Creates a selector for the analytical model geometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalyticalModelSelector()
Visual Basic
Public Sub New
Visual C++
public:
AnalyticalModelSelector()
Remarks
 This version is useful for single-curve or single-point analytical models. Additionally, this only acts with respect to the entire curve or point.
See Also
AnalyticalModelSelector Class
AnalyticalModelSelector Overload
Autodesk.Revit.DB.Structure Namespace